In [1]:
import numpy as np
import pandas as pd

In [5]:
data_candidates_work_places = pd.read_csv('data/data_candidates_work_places.csv', sep=';',
                                names = ['CandidateId', 'Position','FromYear', 'FromMonth', 'ToYear', 'ToMonth'])

In [6]:
data_candidates_work_places.head()

,CandidateId,Position,FromYear,FromMonth,ToYear,ToMonth
0,6582292,Мерчендайзер,2018,7,2019,1
1,6582292,Менеджер по работе с клиентами 5 колесо,2017,6,2018,7
2,2719696,Водитель-экспедитор,2015,1,2016,10
3,2719696,Водитель персональный,2011,11,2014,2
4,2719696,Персональный водитель,2008,3,2011,10

In [9]:
data_jobs = pd.read_csv('data/data_jobs.csv', sep=';',
                                names = ['JobId', 'Status','Name', 'Region', 'Description'])

In [10]:
data_jobs.head()

,JobId,Status,Name,Region,Description
0,163,4,Водитель-экспедитор,Санкт-Петербург,NaN
1,211,4,Водитель (семейный),Санкт-Петербург,NaN
2,232,2,Водитель (автобуса),Санкт-Петербург,---- Требования к опыту ----<br /><br />Водите...
3,288,2,Водитель,Санкт-Петербург,---- Требования к опыту ----<br /><br />от 5 л...
4,292,4,Водитель,Санкт-Петербург,NaN

In [12]:
data_candidates = pd.read_csv('data/data_candidates.csv', sep=';',
                                names = ['CandidateId', 'Position','Sex', 'Citizenship', 'Age',
                                'Salary', 'Langs', 'DriverLicense', 'Subway', 'Skills', 'Employment', 'Shedule',                                            'CandidateRegion', 'DateCreated', 'JobId', 'CandidateStatusId', 'Status'])

In [13]:
data_candidates.head()

,CandidateId,Position,Sex,Citizenship,Age,Salary,Langs,DriverLicense,Subway,Skills,Employment,Shedule,CandidateRegion,DateCreated,JobId,CandidateStatusId,Status
0,7435,Водитель-экспедитор,2,Россия,21,0,NaN,NaN,NaN,NaN,Full,Full,Санкт-Петербург,2014-01-15 00:00:00.0000000,163,1425,Отклонен
1,7445,Водитель-экспедитор,2,Россия,23,0,NaN,NaN,NaN,NaN,Full,Full,Санкт-Петербург,2014-01-15 00:00:00.0000000,163,1425,Отклонен
2,7450,Водитель-экспедитор,2,Россия,31,0,NaN,NaN,NaN,NaN,Full,Full,Санкт-Петербург,2014-01-15 00:00:00.0000000,163,1425,Отклонен
3,7452,Водитель-экспедитор,2,Россия,23,0,NaN,NaN,NaN,NaN,Full,Full,Санкт-Петербург,2014-01-15 00:00:00.0000000,163,1425,Отклонен
4,7453,Водитель-экспедитор,2,Россия,27,0,NaN,NaN,NaN,NaN,Full,Full,Санкт-Петербург,2014-01-15 00:00:00.0000000,163,1425,Отклонен

In [15]:
data_candidates_education = pd.read_csv('data/data_candidates_education.csv', sep=';',
                                names = ['CandidateId', 'University', 'Faculty', 'GraduateYear'])

In [16]:
data_candidates_education.head()

,CandidateId,University,Faculty,GraduateYear
0,1300011,Бендерский Политехнический Лицей-Колледж,Техническое обслуживание и ремонт автомобильно...,1995
1,1300011,средне-специальное,техническое обслуживане и ремонт автотранспорта,1995
2,1300011,Бендерский Политехнический Лицей-Колледж,Техническое обслуживание и ремонт автотранспорта,1995
3,1548847,Борисоглебский медицинский колледж,"лечебное дело, фельдшер",2011
4,1439965,Воронежский государственный архитектурно-строи...,"Заочный, ГСХ",2012